openfoam/OpenFOAM-dev/tutorials/incompressibleVoF/wave/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interfaceHeight1
{
    type            interfaceHeight;
    libs            ("libfieldFunctionObjects.so");
    locations       ((300 0 0) (450 0 0) (600 0 0));
    alpha           alpha.water;
}

// ************************************************************************* //
